https://github.com/okovtun/SBU_411.git
https://www.youtube.com/playlist?list=PLeqyOOqxeiIPOQpgNXXxpmJiUToN-E6oG

IEEE-754:
http://www.softelectro.ru/ieee754.html

TODO:
1.
	* * * * * 
	* * * * * 
	* * * * * 
	* * * * * 
	* * * * * 

2.
	*
	* * 
	* * *
	* * * * 
	* * * * * 

3.
	* * * * * 
	* * * *
	* * *
	* *
	* 
	
4.
	* * * * *
	  * * * *
	    * * *
	      * *
	        *
	
5.
	        *
	      * *
	    * * *
	  * * * *
	* * * * *

6.
	    /\
	   /  \
	  /    \
	 /      \
	/        \
	\        /
	 \      /
	  \    /
	   \  /
	    \/

7.
	+ - + - +
	- + - + -
	+ - + - +
	- + - + -
	+ - + - +

8. https://github.com/okovtun/SBU_411/blob/master/ControlStructures/Picture/ChessBoard.jpg
9. https://github.com/okovtun/SBU_411/blob/master/ControlStructures/Picture/HardChess.jpg
10. ***** Вывести на экран треугольник Паскаля;
11. Свою дату рождения раздклить на 2 группы по 4 разряда, и перевести эти группы в двоичную,
    а потом в Шестнадцатеричную системы счисления, и сделать проверку;


TOREAD:
Длинная арифметика;

DONE:
1. Написать программу, которая вычисляет факториал числа, введенного с клавиатуры.		DONE
   Факториал - это произведение ряда чисел от 1 до указанного, например:
	5! = 1*2*3*4*5 = 120;
2. Написать программу, которая возводит указанное число в указанную степень,			DONE
   основание и показатель степени вводятся с клавиатуры;
3. Написать программу, которая выводит на экран таблицу ASCII-символов по 16 в строке;	DONE
4. Вывести на экран ряд Фибоначчи до указанного предела. Предел вводит пользователь с клавиатуры;	DONE
5. Вывести на экран заданное количество чисел из ряда Фибоначчи.
   Количество чисел задает пользователь с клавиатуры;
6. *Вывести на экран ряд простых чисел до указанного предела.			DONE
   Простым называется число, которое делится без остатка только на себя и на единицу;
7. *** Вывести на экран ряд совершенных чисел.
   Совершенным называется число, которое равно сумме всех своих положительных делителей;
8. Вывести на экран таблицу умножения;
9. Вывести на экран таблицу Пифагора;

DONE:
1. В калькуляторе должна быть возможность к предыдущему результату применять другие операции,
   как в обычном Windows-калькуляторе;
2. В Solution 'ControlStructures' добавить проект 'Shooter', и в этои проекте,
   пользователь нажимает на клавиши WASD, и программа выводит на экран действие:
	w - вперед
	s - назад
	a - влево
	d - вправо
	Space - прыжок
	Enter - огонь
	Escape - выход
3. Напомнить про Палиндром;

TODO:
1. Следующие задачи нужно решить без компилятора 
   (в компиляторе можно только проверить решение)
1.1.	int i = 3;
		i = ++i + ++i;
		cout << i << endl;
---------------------------
1.2.	int i = 3;
		i = i++ + ++i;
		cout << i << endl;
---------------------------
1.3.	int i = 3;
		i = i++ + 1 + ++i*2;
		cout << i << endl;
---------------------------
1.4.	int i = 3;
		i = i++ + 1 + ++i*=2;
		cout << i << endl;
---------------------------
1.5.	int i = 3;
		i += i++ + 1 + ++i*=2;
		cout << i << endl;
---------------------------

2. Написать калькулятор, который вычисляет выражения вида:
	2+3
	2+3=5;
3. Пользователь вводит число с клавиатуры, и программа говорит число Палиндром, или нет.
   Палиндром - это число, которое читается одинаково в обоих направлениях, например:
	121
	1221
	12321

DONE:
1. Выучить теорию:
	https://github.com/okovtun/SBU_411/blob/master/DataTypes.pdf
2. Решить все задачи из файла VariablesTask.pdf:
	https://github.com/okovtun/SBU_411/blob/master/DataTypes/VariablesTask.pdf

DONE:
0. Выучить теорию;
1. Вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли,
   а его куплеты должны быть разделены пустой строкой.